In [1]:
import numpy as np
import pandas as pd

In [2]:
#DataFrame(Veri çerçevesi):
#dataframe i serilerin bileştirilmiş hali olarak düşünebiliriz

In [3]:
data = np.random.randn(4,3)
data
#numpy dizisi bir matrix şeklinde 2 boyutlu

array([[-0.38989221,  1.26969717, -0.95345435],
       [ 0.80415893, -0.26094309, -1.23465526],
       [-0.08010719, -0.54096394, -0.57122766],
       [-0.29517861, -0.38874014,  1.67825364]])

In [4]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0 -0.389892  1.269697 -0.953454
1  0.804159 -0.260943 -1.234655
2 -0.080107 -0.540964 -0.571228
3 -0.295179 -0.388740  1.678254

In [5]:
dataFrame[0] #kolon olarak karşımıza getiriyor

0   -0.389892
1    0.804159
2   -0.080107
3   -0.295179
Name: 0, dtype: float64

In [6]:
type(dataFrame[0])

pandas.core.series.Series

In [7]:
yeniDataFrame = pd.DataFrame(data, index=["atil", "zeynep", "atlas","mehmet"],columns = ["maas","yas","calisma saati"])

In [8]:
yeniDataFrame

            maas       yas  calisma saati
atil   -0.389892  1.269697      -0.953454
zeynep  0.804159 -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740       1.678254

In [9]:
yeniDataFrame["yas"]

atil      1.269697
zeynep   -0.260943
atlas    -0.540964
mehmet   -0.388740
Name: yas, dtype: float64

In [10]:
yeniDataFrame["calisma saati"]

atil     -0.953454
zeynep   -1.234655
atlas    -0.571228
mehmet    1.678254
Name: calisma saati, dtype: float64

In [11]:
yeniDataFrame[["maas","yas"]]

            maas       yas
atil   -0.389892  1.269697
zeynep  0.804159 -0.260943
atlas  -0.080107 -0.540964
mehmet -0.295179 -0.388740

In [12]:
yeniDataFrame

            maas       yas  calisma saati
atil   -0.389892  1.269697      -0.953454
zeynep  0.804159 -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740       1.678254

In [13]:
yeniDataFrame.loc["atil"] #atil in değerlerini loc ile seçtik

maas            -0.389892
yas              1.269697
calisma saati   -0.953454
Name: atil, dtype: float64

In [14]:
#index bazlı lokasyonnda mümkün yani iloc:
yeniDataFrame.iloc[:1]

          maas       yas  calisma saati
atil -0.389892  1.269697      -0.953454

In [15]:
yeniDataFrame

            maas       yas  calisma saati
atil   -0.389892  1.269697      -0.953454
zeynep  0.804159 -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740       1.678254

In [16]:
#DataFrame Indexler

In [17]:
yeniDataFrame["emeklilik yasi"] = yeniDataFrame["yas"] + yeniDataFrame["yas"]
yeniDataFrame

            maas       yas  calisma saati  emeklilik yasi
atil   -0.389892  1.269697      -0.953454        2.539394
zeynep  0.804159 -0.260943      -1.234655       -0.521886
atlas  -0.080107 -0.540964      -0.571228       -1.081928
mehmet -0.295179 -0.388740       1.678254       -0.777480

In [18]:
#silme islemi
yeniDataFrame.drop("emeklilik yasi", axis = 1) #axis = 1 columns, axis = 0 rows

            maas       yas  calisma saati
atil   -0.389892  1.269697      -0.953454
zeynep  0.804159 -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740       1.678254

In [19]:
yeniDataFrame.drop("mehmet", axis = 0)

            maas       yas  calisma saati  emeklilik yasi
atil   -0.389892  1.269697      -0.953454        2.539394
zeynep  0.804159 -0.260943      -1.234655       -0.521886
atlas  -0.080107 -0.540964      -0.571228       -1.081928

In [20]:
yeniDataFrame

            maas       yas  calisma saati  emeklilik yasi
atil   -0.389892  1.269697      -0.953454        2.539394
zeynep  0.804159 -0.260943      -1.234655       -0.521886
atlas  -0.080107 -0.540964      -0.571228       -1.081928
mehmet -0.295179 -0.388740       1.678254       -0.777480

In [21]:
yeniDataFrame.drop("emeklilik yasi", axis = 1, inplace = True)

In [22]:
yeniDataFrame

            maas       yas  calisma saati
atil   -0.389892  1.269697      -0.953454
zeynep  0.804159 -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740       1.678254

In [23]:
yeniDataFrame.loc["atil"]["calisma saati"]

-0.9534543486837209

In [24]:
yeniDataFrame.loc["atlas","yas"]

-0.5409639375632221

In [25]:
yeniDataFrame

            maas       yas  calisma saati
atil   -0.389892  1.269697      -0.953454
zeynep  0.804159 -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740       1.678254

In [26]:
yeniDataFrame < 0

         maas    yas  calisma saati
atil     True  False           True
zeynep  False   True           True
atlas    True   True           True
mehmet   True   True          False

In [27]:
booleanFrame = yeniDataFrame < 0

In [28]:
yeniDataFrame

            maas       yas  calisma saati
atil   -0.389892  1.269697      -0.953454
zeynep  0.804159 -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740       1.678254

In [29]:
yeniDataFrame[booleanFrame]

            maas       yas  calisma saati
atil   -0.389892       NaN      -0.953454
zeynep       NaN -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740            NaN

In [30]:
yeniDataFrame[yeniDataFrame < 0]

            maas       yas  calisma saati
atil   -0.389892       NaN      -0.953454
zeynep       NaN -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740            NaN

In [31]:
yeniDataFrame["yas"] > 0

atil       True
zeynep    False
atlas     False
mehmet    False
Name: yas, dtype: bool

In [32]:
yeniDataFrame[yeniDataFrame["yas"] > 0]

          maas       yas  calisma saati
atil -0.389892  1.269697      -0.953454

In [33]:
#Index Değiştirme

In [34]:
yeniDataFrame

            maas       yas  calisma saati
atil   -0.389892  1.269697      -0.953454
zeynep  0.804159 -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740       1.678254

In [35]:
yeniDataFrame.reset_index()

    index      maas       yas  calisma saati
0    atil -0.389892  1.269697      -0.953454
1  zeynep  0.804159 -0.260943      -1.234655
2   atlas -0.080107 -0.540964      -0.571228
3  mehmet -0.295179 -0.388740       1.678254

In [36]:
yeniDataFrame

            maas       yas  calisma saati
atil   -0.389892  1.269697      -0.953454
zeynep  0.804159 -0.260943      -1.234655
atlas  -0.080107 -0.540964      -0.571228
mehmet -0.295179 -0.388740       1.678254

In [37]:
yeniIndexListesi = ["ati","zey","atl","meh"]

In [38]:
yeniDataFrame["yeni index"] = yeniIndexListesi

In [39]:
yeniDataFrame

            maas       yas  calisma saati yeni index
atil   -0.389892  1.269697      -0.953454        ati
zeynep  0.804159 -0.260943      -1.234655        zey
atlas  -0.080107 -0.540964      -0.571228        atl
mehmet -0.295179 -0.388740       1.678254        meh

In [40]:
yeniDataFrame.set_index("yeni index", inplace = True) #set_index ile hangisini yapmak istiyosak onu index ekliyoruz

In [41]:
yeniDataFrame

                maas       yas  calisma saati
yeni index
ati        -0.389892  1.269697      -0.953454
zey         0.804159 -0.260943      -1.234655
atl        -0.080107 -0.540964      -0.571228
meh        -0.295179 -0.388740       1.678254

In [42]:
yeniDataFrame.loc["ati"]

maas            -0.389892
yas              1.269697
calisma saati   -0.953454
Name: ati, dtype: float64

In [43]:
#Multi Index

In [56]:
ilkIndexler = ["simpson","simpson","simpson","south park","south park", "south park"]

In [57]:
icIndexler = ["homer","barth","marge","cartmen","kenny","kyle"]

In [58]:
birlesmisIndexs = list(zip(ilkIndexler,icIndexler))
birlesmisIndexs
#zip birleştirme işlemi yapıyor

[('simpson', 'homer'),
 ('simpson', 'barth'),
 ('simpson', 'marge'),
 ('south park', 'cartmen'),
 ('south park', 'kenny'),
 ('south park', 'kyle')]

In [59]:
birlesmisIndexs = pd.MultiIndex.from_tuples(birlesmisIndexs)
birlesmisIndexs

MultiIndex([(   'simpson',   'homer'),
            (   'simpson',   'barth'),
            (   'simpson',   'marge'),
            ('south park', 'cartmen'),
            ('south park',   'kenny'),
            ('south park',    'kyle')],
           )

In [60]:
type(birlesmisIndexs)

pandas.core.indexes.multi.MultiIndex

In [61]:
benimCizgiFilm = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [62]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilm) 
cizgiFilmNumpyDizisi

array([['40', 'A'],
       ['10', 'B'],
       ['30', 'C'],
       ['9', 'D'],
       ['10', 'E'],
       ['11', 'F']], dtype='<U11')

In [63]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi, index = birlesmisIndexs, columns = ["Yas", "Meslek"])

In [64]:
cizgiFilmDataFrame

                   Yas Meslek
simpson    homer    40      A
           barth    10      B
           marge    30      C
south park cartmen   9      D
           kenny    10      E
           kyle     11      F

In [66]:
cizgiFilmDataFrame.loc["simpson"]

      Yas Meslek
homer  40      A
barth  10      B
marge  30      C

In [68]:
cizgiFilmDataFrame.loc["south park"].loc["kenny"]

Yas       10
Meslek     E
Name: kenny, dtype: object

In [70]:
cizgiFilmDataFrame

                   Yas Meslek
simpson    homer    40      A
           barth    10      B
           marge    30      C
south park cartmen   9      D
           kenny    10      E
           kyle     11      F

In [71]:
cizgiFilmDataFrame.index.names = ["FilmAdı", "isim"]

In [72]:
cizgiFilmDataFrame

                   Yas Meslek
FilmAdı    isim
simpson    homer    40      A
           barth    10      B
           marge    30      C
south park cartmen   9      D
           kenny    10      E
           kyle     11      F